<script setup lang="ts">
  import Header from "~/components/Header.vue";
  import Heading from "~/components/Heading.vue";
  import Accordion from "~/components/Accordion.vue";
  import Form from "~/components/Form.vue";
  import FormField from "~/components/FormField.vue";
  import Button from "~/components/Button.vue";
</script>

<template>
  <section class="promo section-mb">
    <Header/>
    <div class="promo__container container-main">
      <div class="promo__content">
        <Heading level="h1" customClasses="mb-1">Landing Page</Heading>
        <Heading level="h4" customClasses="mb-2">Что это такое?</Heading>
        <div class="text mb-7">
          <p>Landing Page максимально эффективно доносит выгоду Вашего продукта до посетителя. Его основная задача — увеличение конверсии.</p>
          <p>Между потенциальным клиентом и компанией только одна страница, но она способна заменить целый отдел продаж!</p>
        </div>
        <Button color="purple">ОСТАВИТЬ ЗАЯВКУ</Button>
      </div>
      <div class="promo__img">
        <img src="/public/images/landing.png" alt="">
      </div>
    </div>
  </section>
  <section class="about section-mb">
    <div class="about__container container-main">
      <div class="about__main">
        <div>
          <Heading level="h2" customClasses="mb-5">ЗАЧЕМ ОН ВАМ НУЖЕН?</Heading>
          <div class="text">
            <p>Landing Page может успешно использоваться абсолютно во всех сферах бизнеса. Наиболее очевидную выгоду получают сегменты e-commerce и инфобизнеса. В то же время, он может эффективно повышать авторитет компании, которая совершенно не занимается продажами.</p>
            <p>Landing Page может успешно использоваться абсолютно во всех сферах бизнеса. Наиболее очевидную выгоду получают сегменты e-commerce и инфобизнеса. В то же время, он может эффективно повышать авторитет компании, которая совершенно не занимается продажами.</p>
          </div>
        </div>
        <form action="/" class="about__form">
          <Heading level="h4" customClasses="mb-3">Закажите <span>бесплатную</span> консультацию</Heading>
          <p class="mb-4">Мы подберем вам оптимальное решение.</p>
          <FormField
              id="email"
              type="text"
              placeholder="Email"
              customClass="mb-5"
          />
          <Button color="purple" :fullWidth="true">ОСТАВИТЬ ЗАЯВКУ</Button>
        </form>
      </div>
    </div>
  </section>
  <section class="section-mb">
    <div class="container-main">
      <Heading level="h2" customClasses="text-center mb-8">ПОЧЕМУ СТОИТ СДЕЛАТЬ ЛЕНДИНГ У НАС</Heading>
      <ul class="list list--scattered">
        <li class="list__item">
          <span class="list__item-number">01</span>
          <Heading level="h4">ПОДХОДИМ С ДРУГОЙ СТОРОНЫ</Heading>
          <p>Ваша компания — это индивидуальное творение. Она заслуживает особого внимания, а не «стандартного подхода»</p>
        </li>
        <li class="list__item">
          <span class="list__item-number">02</span>
          <Heading level="h4">ПОДХОДИМ С ДРУГОЙ СТОРОНЫ</Heading>
          <p>Ваша компания — это индивидуальное творение. Она заслуживает особого внимания, а не «стандартного подхода» Ваша компания — это индивидуальное творение. Она заслуживает особого внимания, а не «стандартного подхода»</p>
        </li>
        <li class="list__item">
          <span class="list__item-number">03</span>
          <Heading level="h4">ПОДХОДИМ С ДРУГОЙ СТОРОНЫ</Heading>
          <p>Ваша компания — это индивидуальное творение. Она заслуживает особого внимания, а не «стандартного подхода»</p>
        </li>
        <li class="list__item">
          <span class="list__item-number">04</span>
          <Heading level="h4">ПОДХОДИМ С ДРУГОЙ СТОРОНЫ</Heading>
          <p>Ваша компания — это индивидуальное творение. Она заслуживает особого внимания, а не «стандартного подхода»</p>
        </li>
        <li class="list__item">
          <span class="list__item-number">05</span>
          <Heading level="h4">ПОДХОДИМ С ДРУГОЙ СТОРОНЫ</Heading>
          <p>Ваша компания — это индивидуальное творение. Она заслуживает особого внимания, а не «стандартного подхода»</p>
        </li>
        <li class="list__item">
          <span class="list__item-number">06</span>
          <Heading level="h4">ПОДХОДИМ С ДРУГОЙ СТОРОНЫ</Heading>
          <p>Ваша компания — это индивидуальное творение. Она заслуживает особого внимания, а не «стандартного подхода»</p>
        </li>
      </ul>
    </div>
  </section>
  <section class="steps section-mb">
    <div class="container-main">
      <div class="steps__head">
        <Heading level="h2">ЭТАПЫ РАЗРАБОТКИ ВАШЕГО САЙТА</Heading>
        <div class="text">
          <p>Качественное выполнение каждого из перечисленных этапов — это гарантия успеха всего Вашего проекта</p>
        </div>
      </div>
      <ul class="list list--col-3">
        <li class="list__item">
          <span class="list__item-number">01</span>
          <Heading level="h5" customClasses="mb-2">ПОДХОДИМ С ДРУГОЙ СТОРОНЫ</Heading>
          <p>Ваша компания — это индивидуальное творение. Она заслуживает особого внимания, а не «стандартного подхода»</p>
        </li>
        <li class="list__item">
          <span class="list__item-number">02</span>
          <Heading level="h5" customClasses="mb-2">ПОДХОДИМ С ДРУГОЙ СТОРОНЫ</Heading>
          <p>Ваша компания — это индивидуальное творение. Она заслуживает особого внимания, а не «стандартного подхода»</p>
        </li>
        <li class="list__item">
          <span class="list__item-number">03</span>
          <Heading level="h5" customClasses="mb-2">ПОДХОДИМ С ДРУГОЙ СТОРОНЫ</Heading>
          <p>Ваша компания — это индивидуальное творение. Она заслуживает особого внимания, а не «стандартного подхода»</p>
        </li>
        <li class="list__item">
          <span class="list__item-number">04</span>
          <Heading level="h5" customClasses="mb-2">ПОДХОДИМ С ДРУГОЙ СТОРОНЫ</Heading>
          <p>Ваша компания — это индивидуальное творение. Она заслуживает особого внимания, а не «стандартного подхода»</p>
        </li>
        <li class="list__item">
          <span class="list__item-number">05</span>
          <Heading level="h5" customClasses="mb-2">ПОДХОДИМ С ДРУГОЙ СТОРОНЫ</Heading>
          <p>Ваша компания — это индивидуальное творение. Она заслуживает особого внимания, а не «стандартного подхода»</p>
        </li>
        <li class="list__item">
          <span class="list__item-number">06</span>
          <Heading level="h5" customClasses="mb-2">ПОДХОДИМ С ДРУГОЙ СТОРОНЫ</Heading>
          <p>Ваша компания — это индивидуальное творение. Она заслуживает особого внимания, а не «стандартного подхода»</p>
        </li>
        <li class="list__item">
          <span class="list__item-number">07</span>
          <Heading level="h5" customClasses="mb-2">ПОДХОДИМ С ДРУГОЙ СТОРОНЫ</Heading>
          <p>Ваша компания — это индивидуальное творение. Она заслуживает особого внимания, а не «стандартного подхода»</p>
        </li>
        <li class="list__item">
          <span class="list__item-number">08</span>
          <Heading level="h5" customClasses="mb-2">ПОДХОДИМ С ДРУГОЙ СТОРОНЫ</Heading>
          <p>Ваша компания — это индивидуальное творение. Она заслуживает особого внимания, а не «стандартного подхода»</p>
        </li>
        <li class="list__item">
          <span class="list__item-number">09</span>
          <Heading level="h5" customClasses="mb-2">ПОДХОДИМ С ДРУГОЙ СТОРОНЫ</Heading>
          <p>Ваша компания — это индивидуальное творение. Она заслуживает особого внимания, а не «стандартного подхода»</p>
        </li>
      </ul>
    </div>
  </section>
  <section class="faq section-mb">
    <div class="container-main">
      <div class="faq__content">
        <div>
          <Heading level="h2" customClasses="max-w-[800px] mb-8">ОТВЕТЫ НА САМЫЕ ПОПУЛЯРНЫЕ ВОПРОСЫ</Heading>
          <div class="flex flex-col gap-5">
            <Accordion title="ЧТО ДЕЛАТЬ, ЕСЛИ У МЕНЯ НЕТ ТЕХНИЧЕСКОГО ЗАДАНИЯ?">
              Конечно ✅ Более того, мы не ограничиваемся временными рамками, а предоставляем поддержку проекта бессрочно. Вы можете в любой момент, после разработки вашего сайта обращаться к нам по любым корректировкам или за консультацией. ❗️ВАЖНО: тех. поддержка подразумевает устранение неисправностей в элементах сайта или функционале, которые были предусмотрены в ТЗ. ☝️ Если после разработки сайта вы хотите добавить новые визуальные или функциональные элементы - это считается отдельным фронтом работ, который оценивается также отдельно.
            </Accordion>
            <Accordion title="ПРЕДОСТАВЛЯЕТЕ ЛИ ВЫ ТЕХ. ПОДДЕРЖКУ ПОСЛЕ РАЗРАБОТКИ САЙТА?">
              Конечно ✅ Более того, мы не ограничиваемся временными рамками, а предоставляем поддержку проекта бессрочно. Вы можете в любой момент, после разработки вашего сайта обращаться к нам по любым корректировкам или за консультацией. ❗️ВАЖНО: тех. поддержка подразумевает устранение неисправностей в элементах сайта или функционале, которые были предусмотрены в ТЗ. ☝️ Если после разработки сайта вы хотите добавить новые визуальные или функциональные элементы - это считается отдельным фронтом работ, который оценивается также отдельно.
            </Accordion>
            <Accordion title="ЧТО ДЕЛАТЬ, ЕСЛИ У МЕНЯ НЕТ ТЕХНИЧЕСКОГО ЗАДАНИЯ?">
              Конечно ✅ Более того, мы не ограничиваемся временными рамками, а предоставляем поддержку проекта бессрочно. Вы можете в любой момент, после разработки вашего сайта обращаться к нам по любым корректировкам или за консультацией. ❗️ВАЖНО: тех. поддержка подразумевает устранение неисправностей в элементах сайта или функционале, которые были предусмотрены в ТЗ. ☝️ Если после разработки сайта вы хотите добавить новые визуальные или функциональные элементы - это считается отдельным фронтом работ, который оценивается также отдельно.
            </Accordion>
            <Accordion title="ЧТО ДЕЛАТЬ, ЕСЛИ У МЕНЯ НЕТ ТЕХНИЧЕСКОГО ЗАДАНИЯ?">
              Конечно ✅ Более того, мы не ограничиваемся временными рамками, а предоставляем поддержку проекта бессрочно. Вы можете в любой момент, после разработки вашего сайта обращаться к нам по любым корректировкам или за консультацией. ❗️ВАЖНО: тех. поддержка подразумевает устранение неисправностей в элементах сайта или функционале, которые были предусмотрены в ТЗ. ☝️ Если после разработки сайта вы хотите добавить новые визуальные или функциональные элементы - это считается отдельным фронтом работ, который оценивается также отдельно.
            </Accordion>
            <Accordion title="ЧТО ДЕЛАТЬ, ЕСЛИ У МЕНЯ НЕТ ТЕХНИЧЕСКОГО ЗАДАНИЯ?">
              Конечно ✅ Более того, мы не ограничиваемся временными рамками, а предоставляем поддержку проекта бессрочно. Вы можете в любой момент, после разработки вашего сайта обращаться к нам по любым корректировкам или за консультацией. ❗️ВАЖНО: тех. поддержка подразумевает устранение неисправностей в элементах сайта или функционале, которые были предусмотрены в ТЗ. ☝️ Если после разработки сайта вы хотите добавить новые визуальные или функциональные элементы - это считается отдельным фронтом работ, который оценивается также отдельно.
            </Accordion>
          </div>
        </div>
        <img class="faq__decor" src="public/images/faq-decor.svg" alt="">
      </div>
    </div>
  </section>
  <section class="section-mb">
    <div class="container-main">
      <div class="grid grid-cols-[repeat(2,1fr)] gap-14">
        <div>
          <Heading level="h2" customClasses="max-w-[800px] mb-8">ПЕРЕХОДИМ К <span>ДЕЙСТВИЯМ</span></Heading>
          <div class="text">
            <p>Чтобы создать продукт, который будет «бить в десятку», давайте познакомимся немного поближе!</p>
            <p>Короткая бриф-анкета позволит нам лучше узнать специфику Вашего бизнеса, и сформировать качественное предложение. На заполнение уйдет меньше 5 минут!</p>
          </div>
        </div>
        <Form title="Успешные проекты начинают свой путь с этой формы!" text="Заполните форму и с вами сконтактирует наш специалист" />
      </div>
    </div>
  </section>
</template>
